Repository: hello-yunshu/Xray_bash_onekey
Catalog: po/*.po
Languages: fr, ko

# 即将删除用户, 一次仅能删除一个
source: the user is about to be deleted, only one can be deleted at a time
fr: l'utilisateur sera supprimé, une seule suppression à la fois
ko: 사용자를 삭제할 예정이며, 한 번에 하나만 삭제할 수 있습니다

# 删除用户
source: delete users
fr: supprimer l'utilisateur
ko: 사용자 삭제

# 是否继续删除用户
source: do you continue to delete the user
fr: voulez-vous continuer à supprimer l'utilisateur
ko: 사용자를 계속 삭제하시겠습니까

# 已配置 Xray 流量统计
source: calculated xray traffic statistics
fr: statistiques de trafic xray déjà configurées
ko: xray 트래픽 통계가 이미 구성되었습니다

# 是否需要关闭此功能
source: do you need to close this function
fr: doit-on désactiver cette fonctionnalité
ko: 이 기능을 종료할 필요가 있습니까

# 关闭 Xray 流量统计
source: close xray traffic statistics
fr: fermer la statistique du trafic xray
ko: xray 트래픽 통계 끄기

# 可能会影响 Xray 性能
source: it may affect xray performance
fr: cela pourrait affecter les performances de l'analyseur xray
ko: x레이 성능에 영향을 줄 수 있습니다

# 设置 Xray 流量统计
source: set xray traffic statistics
fr: configurer la statistique du trafic xray
ko: xray 트래픽 통계 설정

# 是否删除所有脚本文件
source: whether to delete all script files
fr: supprimer tous les fichiers de script
ko: 모든 스크립트 파일을 삭제하시겠습니까

# 已删除所有文件
source: all files have been deleted
fr: tous les fichiers ont été supprimés
ko: 모든 파일을 삭제했습니다

# ヾ(￣▽￣) 拜拜~
source: ヾ (￣ ▽ ￣) worship ~
fr: (￣▽￣) ヾ salut~
ko: (￣▽￣) 안녕~

# 已保留脚本文件 (包含 SSL 证书等)
source: a script file has been retained (including ssl certificate, etc.)
fr: fichier de script déjà conservé (contenant certificat ssl, etc.)
ko: 스크립트 파일(ssl 인증서 등 포함)이 보존되었습니다

# 是否保留配置文件
source: whether to keep the configuration file
fr: conserver le fichier de configuration
ko: 구성 파일을 유지할까요

# 已清空证书遗留文件
source: the documents left over the certificate
fr: les fichiers résiduels du certificat ont été effacés
ko: 인증서 잔여 파일을 이미 삭제했습니다

# 存在新版本, 是否更新
source: is there a new version, whether to update
fr: une nouvelle version est disponible, souhaitez-vous la mettre à jour
ko: 새 버전이 존재합니다. 업데이트하시겠습니까

# 更新完成
source: update
fr: mise à jour terminée
ko: 업데이트 완료

# 当前版本为最新版本
source: the current version is the latest version
fr: la version actuelle est la dernière version
ko: 현재 버전은 최신 버전입니다

# 下载最新脚本
source: download the latest script
fr: télécharger le script le plus récent
ko: 최신 스크립트 다운로드

# 该选项暂时无法使用
source: this option is temporarily unavailable
fr: cette option n'est pas disponible pour le moment
ko: 해당 옵션은 일시적으로 사용할 수 없습니다

# 此模式推荐用于负载均衡, 一般情况不推荐使用, 是否安装
source: this model is recommended for load balancing. generally, it is not recommended. whether it is installed
fr: ce mode est recommandé pour l'équilibrage de charge, il n'est généralement pas recommandé d'utiliser, souhaitez-vous installer
ko: 이 모드는 로드 밸런싱에 권장되며, 일반적으로 사용하지 않는 것이 좋습니다. 설치하시겠습니까

# 变更
source: change
fr: changement
ko: 변경

# 负载均衡配置
source: load balancing configuration
fr: configuration d'équilibrage de charge
ko: 로드 밸런싱 구성

# 清除日志文件
source: clear log file
fr: effacer les fichiers journaux
ko: 로그 파일 삭제

# 查看证书状态
source: view certificate status
fr: vérifier l'état du certificat
ko: 인증서 상태 보기

# 更新证书有效期
source: renewal certificate validity period
fr: mettre à jour la validité du certificat
ko: 인증서 유효기간 갱신

# 设置证书自动更新
source: set the certificate automatic update
fr: configurer la mise à jour automatique des certificats
ko: 인증서 자동 갱신 설정

# 设置 Fail2ban 防暴力破解
source: set fail2ban anti -violence cracking
fr: configurer fail2ban pour prévenir les attaques par force brute
ko: fail2ban 폭력적 해킹 공격 방지 설정

# 显示帮助
source: display help
fr: afficher l'aide
ko: 도움 표시

# 更新
source: renew
fr: mise à jour
ko: 업데이트

# 脚本卸载
source: script uninstall
fr: désinstallation de script
ko: 스크립트 제거

# 显示安装信息
source: display installation information
fr: afficher les informations d'installation
ko: 설치 정보 표시

# 加速
source: accelerate
fr: accélérer
ko: 가속

# 升级脚本
source: upgrade script
fr: script de mise à niveau
ko: 업그레이드 스크립트

# 显示
source: show
fr: afficher
ko: 표시

# 访问信息
source: access information
fr: informations de visite
ko: 정보 방문

# 错误信息
source: error message
fr: message d'erreur
ko: 오류 정보

# 检测失败
source: detect failure
fr: échec de la détection
ko: 검사 실패

# 有新版
source: have a new version
fr: il y a une nouvelle version
ko: 새 버전이 있습니다

# 最新版
source: latest version
fr: dernière version
ko: 최신 버전

# 版本未知
source: unknown version
fr: version inconnue
ko: 버전 알 수 없음

# 无需测试
source: no test
fr: pas besoin de tester
ko: 테스트할 필요 없음

# 未运行
source: not running
fr: non exécuté
ko: 실행되지 않음

# 无法连通
source: unable to connect
fr: impossible de se connecter
ko: 연결할 수 없음

# 本地正常
source: local normal
fr: normal localement
ko: 현지 정상

# 请输入数字
source: please enter the number
fr: veuillez entrer un chiffre
ko: 숫자를 입력하세요

# 无效的选择
source: invalid choice
fr: choix invalide
ko: 무효한 선택

# 错误的配置文件删除
source: delete the wrong configuration file
fr: suppression du fichier de configuration incorrect
ko: 잘못된 구성 파일 삭제

# 安装管理脚本
source: installation management script
fr: installer le script de gestion
ko: 관리 스크립트 설치

# 作者
source: author
fr: auteur
ko: 저자

# 当前模式
source: current mode
fr: mode actuel
ko: 현재 모드

# 当前语言
source: current language
fr: langue actuelle
ko: 현재 언어

# 可以使用
source: be available
fr: peut être utilisé
ko: 사용할 수 있습니다

# 命令管理脚本
source: command management script
fr: script de gestion des commandes
ko: 명령 관리 스크립트

# 版本检测
source: version detection
fr: détection de version
ko: 버전 검사

# 脚本
source: script
ko: 스크립트

# 运行状态
source: running status
fr: état de fonctionnement
ko: 운영 상태

# 连通性
source: connectivity
fr: connectivité
ko: 연결성

# 升级向导
source: upgrade guide
fr: assistant de mise à niveau
ko: 업그레이드 가이드

# 安装向导
source: installation wizard
fr: assistant d'installation
ko: 설치 마법사

# 配置变更
source: configuration change
fr: changement de configuration
ko: 구성 변경

# 用户管理
source: user management
fr: gestion des utilisateurs
ko: 사용자 관리

# 查看
source: check
fr: voir
ko: 보기

# 用户
source: user
fr: utilisateur
ko: 사용자

# 查看信息
source: check the information
fr: afficher les informations
ko: 정보 보기

# 实时访问日志
source: real -time visit log
fr: journal d'accès en temps réel
ko: 실시간 접근 로그

# 实时错误日志
source: real -time error log
fr: journal des erreurs en temps réel
ko: 실시간 오류 로그

# 服务相关
source: service -related
fr: service lié
ko: 서비스 관련

# 所有服务
source: all services
fr: tous les services
ko: 모든 서비스

# 证书相关
source: certificate -related
fr: relatif aux certificats
ko: 증명서 관련

# 证书状态
source: certificate status
fr: état du certificat
ko: 인증서 상태

# 证书有效期
source: validity period of certificates
fr: durée de validité du certificat
ko: 인증서 유효기간

# 证书自动更新
source: automatic certificate update
fr: mise à jour automatique des certificats
ko: 인증서 자동 갱신

# 其他选项
source: other options
fr: autres options
ko: 기타 옵션

# 自动更新
source: automatic update
fr: mise à jour automatique
ko: 자동 업데이트

# 防暴力破解
source: anti -violence cracking
fr: protection contre les attaques par force brute
ko: 폭력적 해킹 방지

# 流量统计
source: flow statistics
fr: statistiques de trafic
ko: 트래픽 통계

# 清除
source: remove
fr: effacer
ko: 제거

# 日志文件
source: log file
fr: fichier de journal
ko: 로그 파일

# 测试
source: test
ko: 테스트

# 服务器网速
source: server network speed
fr: vitesse de connexion du serveur
ko: 서버 속도

# 卸载向导
source: unload
fr: assistant de désinstallation
ko: 제거 마법사

# 卸载
source: uninstall
fr: désinstaller
ko: 제거

# 清空
source: empty
fr: vider
ko: 비우다

# 证书文件
source: certificate file
fr: fichier de certificat
ko: 인증서 파일

# 退出
source: quit
fr: quitter
ko: 퇴출

# 请输入选项
source: please enter the option
fr: veuillez saisir une option
ko: 옵션을 입력하세요

# 回到菜单
source: back to the menu
fr: retour au menu
ko: 메뉴로 돌아가기

# 主菜单
source: main menu
fr: menu principal
ko: 메인 메뉴

# 管理
source: manage
fr: gestion
ko: 관리

# 状态
source: state
fr: état
ko: 상태

# 添加自定义规则
source: add custom rules
fr: ajouter une règle personnalisée
ko: 사용자 정의 규칙 추가

# 最大重试次数必须在 1 到 99 之间
source: the maximum number of retries must be between 1 and 99
fr: le nombre maximum de tentatives doit être compris entre 1 et 99
ko: 최대 재시도 횟수는 1에서 99 사이여야 합니다

# 封禁时间必须在 1 到 8640000 秒之间
source: the banned time must be between 1 and 86,40000 seconds
fr: la durée de blocage doit être comprise entre 1 et 8640000 secondes
ko: 봉쇄 시간은 1초에서 8640000초 사이여야 합니다

# 已存在
source: exist
fr: déjà existant
ko: 이미 존재합니다

# 自定义规则添加成功
source: customized rules are successfully added
fr: règle personnalisée ajoutée avec succès
ko: 사용자 정의 규칙 추가 성공

# 重启以应用新规则
source: restart to apply new rules
fr: redémarrez pour appliquer les nouvelles règles
ko: 새로운 규칙을 적용하려면 다시 시작하세요

# 是否要下载并安装新版本
source: whether you want to download and install a new version
fr: voulez-vous télécharger et installer la nouvelle version
ko: 새 버전을 다운로드하여 설치하시겠습니까

# 跳过更新
source: skip the update
fr: ignorer la mise à jour
ko: 업데이트 건너뛰기

# 目录
source: table of contents
fr: table des matières
ko: 목차

# 列出所有
source: list all
fr: énumérer tout
ko: 모두 나열하기

# 文件
source: document
fr: fichier
ko: 파일

# 没有找到
source: not found
fr: non trouvé
ko: 찾을 수 없음

# 文件名
source: file name
fr: nom du fichier
ko: 파일명

# 序号
source: serial number
fr: numéro de série
ko: 순번

# 请输入网址 (例如 hey.run)
source: please enter the url (for example hey.run)
fr: veuillez saisir l'adresse url (par exemple hey.run)
ko: url을 입력하세요 (예: hey.run)

# 不要包含 http:// 或 https:// 开头
source: do not include http: // or https: //
fr: ne pas inclure http:// ou https:// au début
ko: http:// 또는 https://로 시작하지 않도록 하세요

# 网址不能包含 http:// 或 https:// 开头
source: urls cannot include http:/ or https: //
fr: l'adresse url ne peut pas commencer par http:// ou https://
ko: url은 http:// 또는 https://로 시작할 수 없습니다

# 已创建
source: have created
fr: déjà créé
ko: 생성됨

# 请输入要编辑的文件编号
source: please enter the file number to be edited
fr: veuillez saisir le numéro du fichier à éditer
ko: 편집할 파일 번호를 입력하세요

# 已编辑
source: edited
fr: déjà édité
ko: 편집 완료

# 请输入要删除的文件编号
source: please enter the file number to be deleted
fr: veuillez saisir le numéro du fichier à supprimer
ko: 삭제할 파일 번호를 입력하세요

# 不支持的文件扩展名
source: unreachable file extension name
fr: extension de fichier non prise en charge
ko: 지원되지 않는 파일 확장자

# 创建一个新的
source: create a new
fr: créer un nouveau
ko: 새로운 것을 생성하다

# 编辑一个已存在的
source: edit an existing existence
fr: modifier un existant
ko: 기존의 것을 편집하다

# 删除一个已存在的
source: delete one existing
fr: supprimer un existant
ko: 기존의 것을 삭제합니다
