Repository: hello-yunshu/Xray_bash_onekey
Catalog: po/*.po
Languages: fr, ko

# 提醒
source: remind
fr: rappel
ko: 알림

# 错误
source: mistake
fr: erreur
ko: 오류

# 警告
source: warn
fr: avertissement
ko: 경고

# 未安装
source: not installed
fr: non installé
ko: 미설치

# 日志文件归档失败
source: log file archiving failed
fr: échec de l'archivage du fichier journal
ko: 로그 파일 보관 실패

# 清空日志文件失败
source: clear the log file failed
fr: échec de l'effacement du fichier journal
ko: 로그 파일 비우기 실패

# 日志文件已轮转并归档为
source: the log file has been rotated and archived as
fr: le fichier journal a été tourné et archivé sous
ko: 로그 파일이 회전되어 다음과 같이 보관되었습니다

# 当前系统为
source: the current system is
fr: le système actuel est
ko: 현재 시스템은

# 无法获取远程语言文件信息
source: unable to obtain remote language file information
fr: impossible d'obtenir les informations sur le fichier de langue distant
ko: 원격 언어 파일 정보를 가져올 수 없습니다

# 语言文件更新失败
source: language file update failed
fr: échec de la mise à jour du fichier de langue
ko: 언어 파일 업데이트 실패

# 语言文件无效
source: language file is invalid
fr: fichier de langue invalide
ko: 언어 파일이 유효하지 않습니다

# 版本文件更新失败
source: edition file update failed
fr: échec de la mise à jour du fichier de version
ko: 버전 파일 업데이트 실패

# 语言文件更新完成
source: language file update is completed
fr: mise à jour du fichier de langue terminée
ko: 언어 파일 업데이트 완료

# 发现语言文件更新
source: discover the language file update
fr: découvrir la mise à jour du fichier de langue
ko: 언어 파일 업데이트를 발견했습니다

# 完成
source: finish
fr: terminé
ko: 완성

# 失败
source: fail
fr: échec
ko: 실패

# 安装
source: install
fr: installation
ko: 설치

# 已安装
source: installed
fr: déjà installé
ko: 설치됨

# 自启动配置
source: self -start configuration
fr: configuration de démarrage automatique
ko: 자동 실행 설정

# 链接库安装
source: link library installation
fr: installation de la bibliothèque liée
ko: 링크 라이브러리 설치

# 默认值
source: default value
fr: valeur par défaut
ko: 기본값

# 请输入 0-65535 之间的值
source: please enter the value between 0-65535
fr: veuillez saisir une valeur comprise entre 0 et 65535
ko: 0-65535 사이의 값을 입력하세요

# 默认
source: default
fr: par défaut
ko: 기본

# 请输入
source: please enter
fr: veuillez entrer
ko: 입력하세요

# 请输入有效的数字
source: please enter valid numbers
fr: veuillez saisir un nombre valide
ko: 유효한 숫자를 입력하세요

# 是否添加简单 ws/gRPC 协议 用于负载均衡
source: whether to add a simple ws/grpc protocol for load balancing
fr: ajouter ou non le protocole simple ws/grpc pour l'équilibrage de charge
ko: 단순한 ws/grpc 프로토콜을 로드 밸런싱에 추가할 것인지

# 已跳过添加简单 ws/gRPC 协议
source: skip to add simple ws/grpc protocol
fr: ajout du protocole simple ws/grpc déjà ignoré
ko: 간단한 ws/grpc 프로토콜 추가를 건너뛰었습니다

# 是否需要设置防火墙
source: do you need to set up a firewall
fr: doit-on configurer un pare-feu
ko: 방화벽을 설정해야 하나요

# 开放防火墙相关端口
source: open firewall -related port
fr: ouvrir les ports du pare-feu correspondants
ko: 방화벽 관련 포트 개방

# 若修改配置, 请注意关闭防火墙相关端口
source: if you modify the configuration, please pay attention to turn off the firewall -related port
fr: si vous modifiez la configuration, veuillez veiller à désactiver les ports associés au pare-feu
ko: 구성을 수정할 경우 방화벽 관련 포트를 닫는 것을 유의하십시오

# 配置
source: configuration
ko: 구성

# 跳过防火墙设置
source: skip firewall settings
fr: passer la configuration du pare-feu
ko: 방화벽 설정 건너뛰기

# 伪装路径
source: camouflage
fr: chemin de camouflage
ko: 위장 경로

# 不需要
source: unnecessary
fr: pas besoin
ko: 필요하지 않다

# 是否需要修改
source: do you need to modify
fr: doit-on modifier
ko: 수정이 필요합니까

# 用户名
source: username
fr: nom d'utilisateur
ko: 사용자 이름

# 请输入自定义字符串
source: please enter the custom string
fr: veuillez saisir une chaîne personnalisée
ko: 사용자 정의 문자열을 입력하세요

# 最多30字符
source: up to 30 characters
fr: maximum 30 caractères
ko: 최대 30자

# 自定义字符串
source: custom string
fr: chaîne personnalisée
ko: 사용자 정의 문자열

# 映射字符串
source: mapping string
fr: chaîne de mappage
ko: 문자열 매핑

# 检测到 target 域名已配置, 是否保留
source: the target domain name has been configured, whether it is retained
fr: cible détectée, domaine déjà configuré, souhaitez-vous le conserver
ko: 타겟 도메인이 이미 구성된 것을 감지했습니다. 유지하시겠습니까

# 请输入一个域名
source: please enter a domain name
fr: veuillez saisir un nom de domaine
ko: 도메인 이름을 입력하세요

# 域名要求支持 TLSv1.3、X25519 与 H2 以及域名非跳转用
source: the domain name requires support for tlsv1.3, x25519 and h2, and domain name non -jump
fr: le nom de domaine doit prendre en charge tlsv1.3, x25519 et h2, et ne pas être utilisé pour les redirections
ko: 도메인은 tlsv1.3, x25519 및 h2를 지원해야 하며 도메인 리디렉션을 사용하지 않아야 합니다

# 确认域名符合要求后请输入
source: please enter after confirming that the domain name meets the requirements
fr: après avoir confirmé que le nom de domaine est conforme aux exigences, veuillez entrer
ko: 도메인 이름이 요구 사항을 충족하는지 확인한 후 입력해 주십시오

# 正在检测域名请等待
source: please wait for the domain name
fr: vérification du nom de domaine en cours, veuillez patienter
ko: 도메인을 검사 중입니다. 잠시 기다려 주십시오

# 该域名发生了跳转
source: the domain name jumped
fr: ce nom de domaine a subi une redirection
ko: 해당 도메인이 리디렉션되었습니다

# 该域名可能不满足所有要求
source: this domain name may not meet all requirements
fr: ce nom de domaine pourrait ne pas répondre à toutes les exigences
ko: 해당 도메인명이 모든 요구 사항을 충족하지 않을 수 있습니다

# 是否仍要设置此域名
source: do you still have to set this domain name
fr: voulez-vous toujours configurer ce nom de domaine
ko: 이 도메인 이름을 여전히 설정하시겠습니까

# 域名
source: domain name
fr: nom de domaine
ko: 도메인 이름

# 满足所有要求
source: meet all requirements
fr: satisfaire toutes les exigences
ko: 모든 요구 사항을 충족하다

# 默认为
source: default
fr: par défaut pour
ko: 기본값은

# 请选择协议为 ws 或 gRPC
source: please select the protocol to ws or grpc
fr: veuillez sélectionner le protocole ws ou grpc
ko: 프로토콜을 ws 또는 grpc로 선택하세요

# 返回
source: return
fr: retour
ko: 돌아가기

# 请重新输入正确的数字
source: please re -enter the correct number
fr: veuillez saisir à nouveau le bon numéro
ko: 정확한 숫자를 다시 입력해 주세요

# 配置用途可以参考文章
source: you can refer to the article for configuration.
fr: pour la configuration d'utilisation, vous pouvez consulter l'article
ko: 사용 용도는 문서를 참고하십시오

# 修改
source: revise
fr: modifier
ko: 수정

# 端口
source: port
ko: 포트

# 部分新功能需要重新安装才可生效
source: some new functions need to be reinstalled before it can take effect
fr: certaines nouvelles fonctionnalités nécessitent une réinstallation pour entrer en vigueur
ko: 일부 새로운 기능은 다시 설치해야 적용됩니다

# 检测到存在最新版
source: the latest version is detected
fr: dernière version détectée
ko: 최신 버전이 존재하는 것으로 감지됨

# 脚本可能未兼容此版本
source: script may not be compatible with this version
fr: le script pourrait ne pas être compatible avec cette version
ko: 스크립트가 이 버전과 호환되지 않을 수 있습니다

# 是否更新
source: whether to update
fr: mettre à jour ou non
ko: 업데이트 여부

# 升级
source: upgrade
fr: mise à niveau
ko: 업그레이드

# 版本
source: version
ko: 버전

# Reality 协议有流量偷跑的风险
source: reality protocol has the risk of stealing traffic
fr: le protocole reality présente un risque de fuite de trafic
ko: reality 프로토콜은 트래픽 유출의 위험이 있다

# 已跳过安装
source: skip installation
fr: installation ignorée
ko: 설치를 건너뛰었습니다

# 检测到旧版本安装的
source: the old version was installed
fr: ancienne version détectée installée
ko: 이전 버전 설치가 감지되었습니다

# 请先做好备份
source: please make a backup first
fr: veuillez d'abord effectuer une sauvegarde
ko: 먼저 백업을 하십시오

# 是否需要删除 (请删除)
source: do you need to delete (please delete)
fr: doit-on supprimer (veuillez supprimer)
ko: 삭제할 필요가 있습니까 (삭제해 주십시오)

# 已跳过删除
source: skip delete
fr: suppression déjà ignorée
ko: 삭제를 건너뛰었습니다

# 日志目录已更改, 日志清除需要重新设置
source: the log directory has been changed, and the log clearance needs to be reset
fr: le répertoire des journaux a été modifié, la suppression des journaux doit être reconfigurée
ko: 로그 디렉토리가 변경되었으므로, 로그 삭제를 다시 설정해야 합니다

# 即将下载已编译的
source: the compilation is about to be downloaded
fr: téléchargement imminent du compilé
ko: 곧 컴파일된 것을 다운로드할 예정입니다

# 配置文件不完整, 退出升级
source: the configuration file is incomplete, exit and upgrade
fr: le fichier de configuration est incomplet, quitter la mise à niveau
ko: 구성 파일이 불완전합니다. 업그레이드를 종료합니다

# 当前安装模式不需要
source: the current installation mode is not needed
fr: le mode d'installation actuel n'est pas nécessaire
ko: 현재 설치 모드는 필요하지 않습니다

# 配置文件不存在, 退出升级
source: the configuration file does not exist, exit and upgrade
fr: le fichier de configuration n'existe pas, quitter la mise à niveau
ko: 구성 파일이 존재하지 않아 업그레이드를 종료합니다

# 删除旧版
source: delete the old version
fr: supprimer l'ancienne version
ko: 이전 버전 삭제

# 是否保留原 Nginx 配置文件
source: whether to keep the original nginx configuration file
fr: conserver le fichier de configuration nginx original
ko: 기존 nginx 구성 파일을 유지할까요

# 删除
source: delete
fr: supprimer
ko: 삭제

# 已为最新版
source: has been the latest version
fr: déjà à la dernière version
ko: 최신 버전으로 업데이트되었습니다

# 设置后台定时自动更新程序 (包含: 脚本/Xray/Nginx)
source: set the automatic update program (including: script/xray/nginx) when setting a background
fr: configurer un programme de mise à jour automatique en arrière-plan (incluant : script/xray/nginx)
ko: 백그라운드에서 자동 업데이트 프로그램 설정 (포함: 스크립트/xray/nginx)

# 可能自动更新后有兼容问题, 谨慎开启
source: there may be compatible problems after automatic update, and open cautiously
fr: il est possible qu'il y ait des problèmes de compatibilité après la mise à jour automatique ; veuillez l'activer avec prudence
ko: 자동 업데이트 후 호환 문제가 있을 수 있으니 신중히 활성화하세요

# 是否开启
source: whether to open
fr: activer ou non
ko: 활성화 여부

# 设置自动更新
source: set automatic update
fr: configurer la mise à jour automatique
ko: 자동 업데이트 설정

# 已设置自动更新
source: set automatic update
fr: mise à jour automatique configurée
ko: 자동 업데이트가 설정되었습니다

# 是否关闭
source: whether to close
fr: fermer ou non
ko: 종료할까요

# 删除自动更新
source: delete automatic update
fr: supprimer la mise à jour automatique
ko: 자동 업데이트 삭제

# 安装 SSL 证书生成脚本依赖
source: install ssl certificate generating script dependencies
fr: installer les dépendances du script de génération de certificat ssl
ko: ssl 인증서 생성 스크립트 의존성 설치

# 安装 SSL 证书生成脚本
source: install the ssl certificate to generate a script
fr: installer le script de génération de certificat ssl
ko: ssl 인증서 생성 스크립트 설치

# 检测到原域名配置存在, 是否跳过域名设置
source: the presence of the original domain name configuration is detected, whether to skip the domain name settings
fr: la configuration du domaine d'origine a été détectée. voulez-vous ignorer la configuration du domaine
ko: 기존 도메인 구성이 존재하는 것을 감지했습니다. 도메인 설정을 건너뛸까요

# 安装终止
source: install
fr: installation terminée
ko: 설치 종료

# 已跳过域名设置
source: skip domain name settings
fr: configuration du domaine ignorée
ko: 도메인 설정을 건너뛰었습니다

# 确定域名信息
source: determine domain information
fr: déterminer les informations du domaine
ko: 도메인 정보 확인

# 请输入你的域名信息
source: please enter your domain name information
fr: veuillez saisir les informations de votre domaine
ko: 도메인 정보를 입력해 주세요

# 请选择公网IP(IPv4/IPv6)或手动输入域名
source: please select the public network ip (ipv4/ipv6) or manually enter the domain name
fr: veuillez sélectionner une adresse ip publique (ipv4/ipv6) ou saisir manuellement un nom de domaine
ko: 공용 ip(ipv4/ipv6)를 선택하거나 도메인을 수동으로 입력하세요

# 正在获取公网IP信息, 请耐心等待
source: get the public network ip information, please wait patiently
fr: obtention des informations sur l'adresse ip publique, veuillez patienter
ko: 공인 ip 정보를 가져오는 중입니다. 잠시 기다려 주십시오

# 此选项用于服务器商仅提供域名访问服务器
source: this option is used for server vendors to provide only domain name access servers
fr: cette option est utilisée lorsque le fournisseur de serveur ne fournit que l'accès au serveur via un nom de domaine
ko: 이 옵션은 서버 제공업체가 도메인만으로 서버에 접근할 수 있도록 하는 경우에 사용됩니다

# 注意服务器商域名添加 CNAME 记录
source: note that the server business domain name is added cname record
fr: veuillez noter que le fournisseur de serveur doit ajouter un enregistrement cname au nom de domaine
ko: 서버 업체의 도메인에 cname 레코드를 추가하는 것을 주의하세요

# 域名DNS解析IP
source: domain dns analysis ip
fr: résolution dns de nom de domaine vers ip
ko: 도메인 네임 dns 해석 ip

# 公网IP/域名
source: public network ip/domain name
fr: adresse ip publique/domaine
ko: 공용 ip/도메인 이름

# 域名DNS解析IP与公网IP匹配
source: domain dns analysis ip and public network ip match
fr: le dns du nom de domaine résout l'ip correspondant à l'adresse ip publique
ko: 도메인 네임의 dns 해석 ip와 공용 ip가 일치합니다

# 请确保域名添加了正确的 A/AAAA 记录, 否则将无法正常使用 Xray
source: please ensure that the domain name adds the correct a/aaaa record, otherwise it will not be able to use xray normally
fr: veuillez vous assurer que les enregistrements a/aaaa corrects ont été ajoutés au domaine, sinon xray ne pourra pas fonctionner normalement
ko: 도메인에 올바른 a/aaaa 레코드가 추가되었는지 확인해 주세요. 그렇지 않으면 xray를 정상적으로 사용할 수 없습니다

# 域名DNS解析IP与公网IP不匹配, 请选择
source: domain dns parsing ip does not match the public network ip, please select
fr: l'adresse ip obtenue par la résolution dns du nom de domaine ne correspond pas à l'adresse ip publique, veuillez sélectionner
ko: 도메인 네임의 dns 해석 ip가 공용 ip와 일치하지 않습니다. 선택해 주십시오

# 继续安装
source: continue to install
fr: continuer l'installation
ko: 계속 설치

# 重新输入
source: re -enter
fr: saisir à nouveau
ko: 다시 입력

# 终止安装
source: terminate the installation
fr: arrêter l'installation
ko: 설치 중단

# 检测到原IP配置存在, 是否跳过IP设置
source: detecting the existence of the original ip configuration, whether to skip the ip settings
fr: configuration ip originale détectée, souhaitez-vous ignorer la configuration ip
ko: 기존 ip 설정이 존재하는 것을 감지했습니다. ip 설정을 건너뛸까요

# 已跳过IP设置
source: skip ip settings
fr: paramètres ip ignorés
ko: ip 설정을 건너뛰었습니다

# 确定公网IP信息
source: determine the public network ip information
fr: déterminer les informations sur l'adresse ip publique
ko: 공용 ip 정보 확인

# 请选择公网IP为IPv4或IPv6
source: please select the public network ip as ipv4 or ipv6
fr: veuillez sélectionner une adresse ip publique en ipv4 ou ipv6
ko: 공용 ip를 ipv4 또는 ipv6로 선택하세요

# 手动输入
source: manually input
fr: saisie manuelle
ko: 수동 입력

# 证书配置成功
source: successful certificate configuration
fr: configuration du certificat réussie
ko: 인증서 설정 성공

# 检测到 Xray 配置过多用户
source: testing too many users in xray configuration
fr: détection d'un nombre excessif d'utilisateurs configurés pour xray
ko: xray가 너무 많은 사용자를 구성한 것을 감지했습니다

# 是否保留原 Xray 配置文件
source: whether to keep the original xray configuration file
fr: conserver le fichier de configuration xray original
ko: 기존 xray 구성 파일을 유지할까요

# 添加简单 ws/gRPC 协议
source: add simple ws/grpc protocol
fr: ajouter le protocole simple ws/grpc
ko: 간단한 ws/grpc 프로토콜 추가

# 检测到配置文件, 是否读取配置文件
source: detect the configuration file, whether to read the configuration file
fr: fichier de configuration détecté, souhaitez-vous lire le fichier de configuration
ko: 구성 파일을 감지했습니다. 구성 파일을 읽으시겠습니까

# 已删除配置文件
source: deleted configuration file
fr: profil supprimé
ko: 구성 프로파일이 삭제되었습니다

# 已保留配置文件
source: the configuration file has been retained
fr: profil déjà réservé
ko: 구성 파일이 보존되었습니다

# 检测到当前安装模式与配置文件的安装模式不一致
source: the current installation mode is detected that the installation mode of the configuration file is inconsistent
fr: le mode d'installation actuel est détecté comme étant incompatible avec le mode d'installation du profil
ko: 현재 설치 모드가 구성 파일의 설치 모드와 일치하지 않는 것으로 감지되었습니다

# 是否保留配置文件 (强烈不建议)
source: whether to keep the configuration file (strong is not recommended)
fr: conserver le fichier de configuration (fortement déconseillé)
ko: 구성 파일을 유지할지 여부 (강력히 권장하지 않음)

# 请务必确保配置文件正确
source: please make sure the configuration file is correct
fr: veuillez vous assurer que le fichier de configuration est correct
ko: 구성 파일이 정확한지 꼭 확인해 주십시오

# 检测到配置文件不完整, 是否保留配置文件
source: the configuration file is not complete, whether the configuration file is retained
fr: fichier de configuration détecté incomplet, souhaitez-vous conserver le fichier de configuration
ko: 구성 파일이 불완전한 것으로 감지되었습니다. 구성 파일을 유지하시겠습니까

# 设置 Nginx 开机自启
source: set nginx and start self -starting
fr: configurer le démarrage automatique de nginx
ko: nginx 자동 시작 설정

# 设置
source: set up
fr: configurer
ko: 설정

# 关闭 Nginx 开机自启
source: turn off nginx and start self -starting
fr: désactiver le démarrage automatique de nginx
ko: nginx 자동 실행 비활성화

# 停止已有服务
source: stop existing service
fr: arrêter le service existant
ko: 기존 서비스를 중지하다

# 重启
source: restart
fr: redémarrer
ko: 재부팅

# 启动
source: start up
fr: démarrer
ko: 시작

# 停止
source: stop
fr: arrêter
ko: 정지

# 新版本已自动设置证书自动更新
source: the new version has been automatically set up automatically update
fr: la nouvelle version a automatiquement configuré la mise à jour automatique des certificats
ko: 새 버전에서 인증서 자동 갱신이 이미 자동으로 설정되었습니다

# 已设置改版证书自动更新
source: automatically update the revision certificate
fr: la mise à jour automatique du certificat de révision est déjà configurée
ko: 버전 변경 인증서 자동 업데이트가 설정되었습니다

# 是否需要删除改版证书自动更新 (请删除)
source: do you need to delete the revision certificate and update automatically (please delete)
fr: doit-on supprimer la mise à jour automatique du certificat de révision (veuillez supprimer)
ko: 개편된 인증서 자동 업데이트를 삭제할 필요가 있습니까 (삭제해 주십시오)

# 删除改版证书自动更新
source: delete the revision certificate automatic update
fr: supprimer la mise à jour automatique du certificat révisé
ko: 개정된 인증서 자동 업데이트 삭제

# 已过期
source: extension
fr: dépassé
ko: 만료됨

# 证书生成日期
source: certificate generation date
fr: date de génération du certificat
ko: 인증서 생성일

# 证书生成天数
source: certificate generation days
fr: nombre de jours pour la génération du certificat
ko: 인증서 생성 일수

# 证书剩余天数
source: certificate remaining days
fr: nombre de jours restants du certificat
ko: 인증서 남은 일수

# 是否立即更新证书
source: do you update the certificate immediately
fr: mettre à jour immédiatement le certificat
ko: 인증서를 즉시 업데이트할까요

# 证书更新
source: certificate update
fr: mise à jour du certificat
ko: 증명서 업데이트

# 检测到日志文件大小如下:
source: the size of the log file is detected as follows:
fr: taille du fichier journal détectée comme suit
ko: 로그 파일 크기가 다음과 같이 감지되었습니다

# 日志清理
source: log cleaning
fr: nettoyage des journaux
ko: 로그 정리

# 已设置旧版自动清理日志任务
source: the old version of the automatic cleaning log task has been set up
fr: la tâche de nettoyage automatique des journaux de l'ancienne version a été configurée
ko: 이전 버전의 자동 로그 정리 작업을 설정했습니다

# 是否需要删除旧版自动清理日志任务
source: do you need to delete the old version of the automatic cleaning log task
fr: doit-on supprimer la tâche de nettoyage automatique des journaux de l'ancienne version
ko: 이전 버전의 자동 정리 로그 작업을 삭제할 필요가 있습니까

# 保留现有自动清理日志任务
source: keep the existing automatic cleaning log task
fr: conserver la tâche existante de nettoyage automatique des journaux
ko: 기존 자동 로그 정리 작업 유지

# 删除旧版自动清理日志任务
source: delete the old version of the automatic cleaning log task
fr: supprimer la tâche de nettoyage automatique des journaux de l'ancienne version
ko: 구버전 자동 정리 로그 작업 삭제

# 是否需要设置自动清理日志
source: do you need to set up an automatic cleaning log
fr: doit-on configurer la suppression automatique des journaux
ko: 로그 자동 정리 설정이 필요합니까

# 将在 每周三 04:00 自动清空日志
source: the log will be automatically emptied every wednesday at 04:00
fr: les journaux seront automatiquement vidés tous les mercredis à 04h00
ko: 매주 수요일 04:00에 로그가 자동으로 비워집니다

# 已设置自动清理日志任务
source: automatic cleaning log task has been set up
fr: la tâche de nettoyage automatique des journaux a été configurée
ko: 로그 자동 정리 작업이 설정되었습니다

# 是否需要删除现有自动清理日志任务
source: do you need to delete the existing automatic cleaning log task
fr: doit-on supprimer la tâche existante de nettoyage automatique des journaux
ko: 기존 자동 로그 정리 작업을 삭제할 필요가 있습니까

# 删除自动清理日志任务
source: delete the automatic cleaning log task
fr: supprimer la tâche de nettoyage automatique des journaux
ko: 자동 정리 로그 작업 삭제

# 设置自动清理日志
source: set automatic cleaning log
fr: configurer la suppression automatique des journaux
ko: 로그 자동 정리 설정

# 二维码
source: qr code
fr: code qr
ko: qr 코드

# 生成分享链接
source: generate sharing link
fr: générer un lien de partage
ko: 공유 링크 생성

# 配置信息
source: configuration information
fr: informations de configuration
ko: 설정 정보

# 主机
source: host
fr: hôte
ko: 호스트

# 用户id
source: user id
fr: identifiant d'utilisateur
ko: 사용자 id

# 加密
source: encryption
fr: chiffrement
ko: 암호화

# 传输协议
source: transmission protocol
fr: protocole de transmission
ko: 전송 프로토콜

# 底层传输安全
source: safety of underlying transmission
fr: sécurité de la couche de transport
ko: 기저 전송 보안

# 路径
source: path
fr: chemin
ko: 경로

# 流控
source: flow control
fr: contrôle de flux
ko: 유량 제어

# 即将申请证书, 支持使用自定义证书
source: to apply soon, support the use of custom certificates
fr: vais demander un certificat, supporte l'utilisation de certificats personnalisés
ko: 인증서를 곧 신청할 예정이며, 사용자 정의 인증서를 지원합니다

# 如需使用自定义证书, 请按如下步骤:
source: if you need to use a custom certificate, please follow the steps below:
fr: si vous souhaitez utiliser un certificat personnalisé, veuillez suivre les étapes ci-dessous
ko: 사용자 정의 인증서를 사용하려면 다음 단계를 따르십시오

# 1. 将证书文件重命名: 私钥(xray.key)、证书(xray.crt)
source: 1. rename the certificate document: the key (xray.key), the certificate (xray.crt)
fr: 1. renommer le fichier de certificat : clé privée (xray.key), certificat (xray.crt)
ko: 1. 인증서 파일의 이름을 변경합니다: 개인 키(xray.key), 인증서(xray.crt)

# 2. 将重命名后的证书文件放入
source: 2. put the renamed certificate file in
fr: 2. placez le fichier de certificat renommé dans
ko: 2. 이름이 변경된 인증서 파일을 넣으십시오

# 目录后再运行脚本
source: run the script after the directory
fr: exécuter le script après la table des matières
ko: 목록 뒤에 스크립트를 실행합니다

# 3. 重新运行脚本
source: 3. run the script again
fr: 3. exécuter à nouveau le script
ko: 3. 스크립트를 다시 실행합니다

# 是否继续
source: whether to continue
fr: continuer ou non
ko: 계속할 것인지

# 所有证书文件均已存在, 是否保留
source: all certificate documents already exist, whether to keep
fr: tous les fichiers de certificat existent déjà, souhaitez-vous les conserver
ko: 모든 인증서 파일이 이미 존재합니다. 유지하시겠습니까

# 已删除
source: deleted
fr: supprimé
ko: 삭제됨

# 证书应用
source: certificate application
fr: application de certificat
ko: 인증서 응용

# 证书文件已存在, 是否保留
source: certificate documents have existed, whether to keep
fr: le fichier de certificat existe déjà, souhaitez-vous le conserver
ko: 인증서 파일이 이미 존재합니다. 유지하시겠습니까

# 证书签发残留文件已存在, 是否保留
source: certificate issuance of residual documents has existed, is it retained?
fr: le fichier résiduel de la signature du certificat existe déjà, souhaitez-vous le conserver
ko: 인증서 발급 잔류 파일이 이미 존재합니다. 유지하시겠습니까

# 添加
source: add to
fr: ajouter
ko: 추가

# 请选择支持的 TLS 版本
source: please select the supported tls version
fr: veuillez sélectionner la version tls prise en charge
ko: 지원되는 tls 버전을 선택하세요

# 建议选择 TLS1.3 only (安全模式)
source: it is recommended to select tls1.3 only (security mode)
fr: il est recommandé de choisir tls1.3 uniquement (mode sécurisé)
ko: tls1.3만 선택하는 것을 권장합니다(보안 모드)

# 兼容模式
source: compatible mode
fr: mode de compatibilité
ko: 호환 모드

# 安全模式
source: security mode
fr: mode sécurisé
ko: 안전 모드

# Nginx/配置文件不存在 或 当前模式不支持
source: nginx/configuration file does not exist or the current mode is not supported
fr: nginx/fichier de configuration inexistant ou mode actuel non pris en charge
ko: nginx/구성 파일이 존재하지 않거나 현재 모드가 지원되지 않습니다

# 即将显示用户, 一次仅能显示一个
source: the user is about to be displayed, only one can be displayed at a time
fr: affichage des utilisateurs à venir, un seul utilisateur peut être affiché à la fois
ko: 사용자가 곧 표시됩니다. 한 번에 하나만 표시할 수 있습니다

# 选择错误
source: choose an error
fr: erreur de sélection
ko: 선택 오류

# 请先检测 Xray 是否正确安装
source: please check whether xray is installed correctly
fr: veuillez d'abord vérifier que xray est correctement installé
ko: 먼저 xray가 올바르게 설치되었는지 확인해 주십시오

# 是否继续显示用户
source: whether to continue displaying users
fr: continuer à afficher l'utilisateur
ko: 사용자를 계속 표시할지 여부

# 此模式不支持删除用户
source: this mode does not support deleting users
fr: ce mode ne prend pas en charge la suppression d'utilisateurs
ko: 이 모드는 사용자 삭제를 지원하지 않습니다

# 即将添加用户, 一次仅能添加一个
source: the user is about to be added, only one can be added at a time
fr: ajout d'utilisateur en cours, un seul utilisateur peut être ajouté à la fois
ko: 사용자를 추가할 예정이며, 한 번에 하나씩만 추가할 수 있습니다

# 添加用户
source: add users
fr: ajouter un utilisateur
ko: 사용자 추가

# 是否继续添加用户
source: do you continue to add users
fr: voulez-vous continuer à ajouter des utilisateurs
ko: 사용자를 계속 추가하시겠습니까

# 此模式不支持添加用户
source: this model does not support adding users
fr: ce mode ne prend pas en charge l'ajout d'utilisateurs
ko: 이 모드는 사용자 추가를 지원하지 않습니다
